# SketchEditScope Properties

---
The SketchEditScope type exposes the following members.
| Name| Description
---|---|---
| IsActive|  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. (Inherited from EditScope)
| IsPermitted|  Tells if the edit scope is permitted to start. (Inherited from EditScope)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from EditScope)
Top
#### Reference
SketchEditScope Class
Autodesk.Revit.DB Namespace